app/views/albums/index.html.erb


<td><%= link_to (image_tag album.photos.first.avatar.url(:medium),{:size =>"50x50"}), album_path(album) unless album.photos.empty? %></td>
---
SELECT COUNT(*) FROM `photos` WHERE `photos`.`album_id` = 9
SELECT `photos`.* FROM `photos` WHERE `photos`.`album_id` = 9 LIMIT 1