app/views/albums/show.html.erb

  <b>Photos (CLICK PHOTO TO VIEW TAGS!!!)</b>
  <% if @album.photos.size== 0 %>
---
SELECT COUNT(*) FROM `photos` WHERE `photos`.`album_id` = 15
SELECT `photos`.* FROM `photos` WHERE `photos`.`album_id` = 2