app/views/photos/index.html.erb

SELECT `tags`.* FROM `tags` WHERE (lower(name) = 'fgfhgfh')
---
<tr><td> TAGS ARE</td>
	<td><%= raw  photo.tag_list.map { |t| link_to t, tag_path(t) }.join(', ') %></td>