app/controllers/albums_controller.rb

  def show

    @album = current_user.albums.find(params[:id])
---
SELECT `albums`.* FROM `albums` WHERE `albums`.`user_id` = 1 AND `albums`.`id` = 15 LIMIT 1

  def edit
    @album = current_user.albums.find(params[:id])
---
SELECT `albums`.* FROM `albums` WHERE `albums`.`user_id` = 1 AND `albums`.`id` = 1 LIMIT 1

  def create
#    @album =current_user.albums.create(:title =>params[:album][:title])
#    current_user.photos.create(params[:album][:avatar])
    @album = current_user.albums.create(params[:album])
    respond_to do |format|
      if @album.save
---
INSERT INTO `albums` (`created_at`, `title`, `updated_at`, `user_id`) VALUES ('2013-06-19 10:20:55', '1 ki hai', '2013-06-19 10:20:55', NULL)
UPDATE `albums` SET `created_at` = '2013-06-20 07:52:12', `updated_at` = '2013-06-20 07:52:12' WHERE `albums`.`id` = 6

  def update
    @album = current_user.albums.find(params[:id])
    respond_to do |format|
      if @album.update_attributes(:title => params[:album][:title])
---
SELECT `albums`.* FROM `albums` WHERE `albums`.`user_id` = 1 AND `albums`.`id` = 1 LIMIT 1
UPDATE `albums` SET `title` = 'hh111', `updated_at` = '2013-06-19 12:58:48' WHERE `albums`.`id` = 7

  def destroy
    #debugger
    @album = current_user.albums.find(params[:id])
    @album.destroy
---
SELECT `albums`.* FROM `albums` WHERE `albums`.`user_id` = 1 AND `albums`.`id` = 7 LIMIT 1
DELETE FROM `albums` WHERE `albums`.`id` = 7