app/controllers/home_controller.rb

  def index
    user=User.find_by_id(current_user.id)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1