app/controllers/photos_controller.rb

SELECT `albums`.* FROM `albums` WHERE `albums`.`user_id` = 2 AND `albums`.`id` = 12 LIMIT 1
INSERT INTO `photos` (`album_id`, `avatar_content_type`, `avatar_file_name`, `avatar_file_size`, `avatar_updated_at`, `created_at`, `updated_at`, `user_id`) VALUES (12, 'image/jpeg', 'post-it.jpg', 56705, '2013-06-20 12:23:20', '2013-06-20 12:23:21', '2013-06-20 12:23:21', NULL)
---
    def create
    @album = current_user.albums.find(params[:album_id])
    respond_to do |format|
      if params[:photo]!=nil
        @album.photos.create(params[:photo])

SELECT `albums`.* FROM `albums` WHERE `albums`.`user_id` = 1
SELECT `photos`.* FROM `photos` JOIN taggings photos_taggings_a5592e4 ON photos_taggings_a5592e4.taggable_id = photos.id AND photos_taggings_a5592e4.taggable_type = 'Photo' AND photos_taggings_a5592e4.tag_id = 11
SELECT COUNT(*) FROM `photos` JOIN taggings photos_taggings_98384dd ON photos_taggings_98384dd.taggable_id = photos.id AND photos_taggings_98384dd.taggable_type = 'Photo' AND photos_taggings_98384dd.tag_id = 1 WHERE `photos`.`id` IN (4, 13, 14, 28, 5, 15, 29, 30)
SELECT `photos`.* FROM `photos` JOIN taggings photos_taggings_f1ece38 ON photos_taggings_f1ece38.taggable_id = photos.id AND photos_taggings_f1ece38.taggable_type = 'Photo' AND photos_taggings_f1ece38.tag_id = 31 WHERE `photos`.`id` IN (6, 8, 9, 10, 11, 16, 7, 12, 20, 17, 18, 19, 21, 22, 23, 24, 25, 26, 27)
---
  def index
    array=Array.new();
    current_user.albums.each do |album|
     album.photos.each do |photo|
       array.push(photo.id)
       end
     end
    if params[:tag]
    @photos = Photo.tagged_with(params[:tag]).where(:id => array)

SELECT `albums`.* FROM `albums` WHERE `albums`.`user_id` = 1 AND `albums`.`id` = 6 LIMIT 1
SELECT `photos`.* FROM `photos` WHERE `photos`.`album_id` = 6 AND `photos`.`id` = 4 LIMIT 1
---
def show
  @album = current_user.albums.find(params[:album_id])
  @photo=@album.photos.find(params[:id])

SELECT `albums`.* FROM `albums` WHERE `albums`.`user_id` = 1 AND `albums`.`id` = 8 LIMIT 1
SELECT `photos`.* FROM `photos` WHERE `photos`.`album_id` = 8 AND `photos`.`id` = 15 LIMIT 1
UPDATE `photos` SET `updated_at` = '2013-06-21 08:16:18' WHERE `photos`.`id` = 15
---
def update

@album = current_user.albums.find(params[:album_id])
  @photo=@album.photos.find(params[:id])

    respond_to do |format|
      if @photo.update_attributes(params[:photo])